[{"title":"New Build System and improving CI/CD workflow","date":"2023-03-30T21:14:00","slug":"my-gsoc-proposal","category":"gsoc","description":"It has been 2 years since I was a Google Summer of Code Student. It was an outstanding opportunity and I really enjoyed working on the project. Not only that, but it added numerous skills to my resume and polished many others. Today I want to make my proposal public, that helped me get selected.","image":"/images/panda-engineer.webp"},{"title":"Tekton Results to the Rescue","date":"2023-03-16T20:47:00","slug":"hey-tekton-results","category":"blogs","image":"/images/tekton-results-wall.webp","description":"Tekton Results aims to help users logically group CI/CD workload history and separate out long term result storage away from the Pipeline controller."},{"title":"Developing Minimal Tekton Server","slug":"lovely-dangerous-things-redhat","image":"/images/development.webp","description":"This blog is a descreptive account of the development of Minimal Tekton Server. This is highly technical in nature, so please make sure that you have sufficient knowledge about Golang, Docker, Kubernetes and TektonCD.","date":"2022-02-27T20:47:00","category":"development"},{"title":"I am loving it! RedHat","slug":"i-am-loving-it-redhat","image":"/images/fedora-wall.webp","description":"I made it to the Red Hat as a DevTools intern. This post is about onboarding and how I prepared myself for working on the actual project.","date":"2022-02-25T20:47:00","category":"development"},{"title":"GSoC'21 Final Evaluation Report","slug":"final-evaluation","image":"/images/gsoc-wall.webp","description":"This is the final report of my Google Summer of Code 2021 at The FOSSology Project. One of the major improvements over the previous build system is faster build times. CMake generates parallel build-enabled configurations for all generators.","date":"2021-08-19T23:07:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 10","slug":"meeting-11","image":"/images/tech-wallpaper-12.webp","description":"This week I implemented CMake testing configuration and fixed most of the tests. As of now all but 5 tests are working fine.","date":"2021-08-14T22:47:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 9","slug":"meeting-10","image":"/images/tech-wallpaper-11.webp","description":"This week I worked on CMake testing configuration. Most of the time was spent understanding the previous testing architecture.","date":"2021-08-06T22:47:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 8","slug":"meeting-9","image":"/images/tech-wallpaper-10.webp","description":"This week I implemented CMake packaging configuration for FOSSology. The new configuration fixes issue with previous packaging configurations. It also retains the component wise installation features.","date":"2021-07-30T22:47:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 7","slug":"meeting-8","image":"/images/tech-wallpaper-9.webp","description":"This week I implemented CMake packaging configuration for FOSSology. There were two meetings in this week and this report covers both of them.","date":"2021-07-23T22:22:00","category":"gsoc"},{"title":"GSoC'21 First Evaluation Report","slug":"first-evaluation","image":"/images/tech-wallpaper.webp","description":"In the first phase of GSoC 2021 at The FOSSology Project, I have completed the desired milestone. As of now, FOSSology can be installed completely via CMake and most of the components are working fine in initial testing.","date":"2021-07-14T12:29:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 5","slug":"meeting-7","image":"/images/tech-wallpaper-8.webp","description":"This week was dedicated to perfecting CMake Installation Configuration. The installation was tested and bugs were discussed.","date":"2021-07-09T22:22:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 4.2","slug":"meeting-6","image":"/images/tech-wallpaper-7.webp","description":"In this eighth meeting questions related to post install generation were asked. This was a short meeting.","date":"2021-07-02T22:22:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 4.1","slug":"meeting-5","image":"/images/tech-wallpaper-6.webp","description":"In this seventh meeting question related to installing the FOSSology were discussed.","date":"2021-06-29T23:22:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 3","slug":"meeting-4","image":"/images/tech-wallpaper-5.webp","description":"In this fifth meeting, question related to versioning and obtaining commit hash were discussed, this was a short meeting.","date":"2021-06-22T23:22:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 2","slug":"meeting-3","image":"/images/tech-wallpaper-4.webp","description":"In this fourth meeting, a lot of questions were discussed related to the existing build system and what things we have to drop or modify.","date":"2021-06-18T23:30:00","category":"gsoc"},{"title":"GSoC'21 Coding Week 1","slug":"meeting-2","image":"/images/tech-wallpaper-3.webp","description":"In this third meeting, I demoed the working build system, currently building executables and libraries, a lot of queries were resolved about writing version files and attaching commits and hashes to the build.","date":"2021-06-11T23:30:00","category":"gsoc"},{"title":"GSoC'21 Community Bonding Week 1","slug":"meeting-1","image":"/images/tech-wallpaper-2.webp","description":"In this second meeting points over default Makefiles were discussed. Ninja can be used as an alternative for Makefiles.","date":"2021-06-04T22:30:00","category":"gsoc"},{"title":"GSoC'21 Community Bonding Week 0","slug":"meeting-0","image":"/images/tech-wallpaper-1.webp","description":"This meeting is the first of the recurring weekly GSoC project meetings. In this meeting the current status of progress according to the proposal was discussed and some topics related to current build system based on Make and the new build system based on CMake.","date":"2021-05-28T21:30:00","category":"gsoc"},{"title":"Hello CMake","slug":"cmake-basics","image":"/images/cmake-office.webp","description":"CMake stands for Cross-platform Make. Normally, a build tool like Make will parse a configuration file (Makefile) that contains all the commands required to build an artifact based on the source files and other resources inside the project.","date":"2021-05-24T23:56:00","category":"development"},{"title":"How I implemented WakaTime embeddable Coding Graph GHA?","slug":"wakatime-readme","image":"/images/waka.webp","description":"If you use WakaTime to track your coding activity. You can add that to your README as a bar graph or embed it in your blog/portfolio. Just add this action to any of your repositories and there you have it.","date":"2021-02-02T21:47:00","category":"development"},{"title":"HRT (Hudson River Trading) Systems Internship Interview Experience","slug":"hrt-interview-1","image":"/images/hrt-singapore.webp","description":"Questions were clear and of medium level. But they were designed in such a way that you must know the basics before you could attempt. Also, they expected a clear and concise approach.","date":"2021-01-04T21:47:00","category":"blogs"},{"title":"Move WSL 2 Safely to another Drive","slug":"wsl1","image":"/images/windows-wsl2.webp","description":"It is real pain when you have small SSD and Windows Subsystem for Linux (WSL) is growing exponentially in size. There is no easy way to move the WSL installation to another drive. Here in this blog I will discuss how to tackle this problem with bite size steps.","date":"2020-12-31T19:07:00","category":"development"},{"title":"Create the VLC User Documentation for one Mobile Port(Android)","slug":"gsod2020-report","image":"/images/day-of-cone.webp","description":"The project was to Create the VLC User Documentation for Android Mobile Port which was previously hosted on VLC wiki pages. The major portion of this was to start everything from scratch including chapter separation, section organization.","date":"2020-12-01T23:47:00","category":"blogs"},{"title":"प्रेम रतन धन पायो","slug":"for-sunshine","image":"/images/fedora-night.webp","description":"प्रकृति की सुंदरता और कलाकारी हिमालय की कण-कण में झलकती है। प्रकृति ने प्रेम को भी हिमालय के जितना ही विशाल और अलौकिक बनाया है । ये एक अलग चर्चा का विषय है कि हिमालय पहले आया या प्रेम। मैं तो प्रेम के पक्ष में हूँ । वो हर अणु-परमाणु जिन्होंने इतने बड़ा पहाड़ खड़ा किया वो सब आपस में प्रेम से बंधे हुए हैं। ये पृथ्वी, सूर्य, चंद्रमा, आकाश-गंगा इत्यादि सब प्रेम से बंधे हुए हैं","date":"2019-09-21T15:47:00","category":"articles"},{"title":"The Big Red Ants","slug":"big-red-ants","image":"/images/ants.webp","description":"As I observed them making and reparing their nests, I concluded that they are laborious and intellectual. They create their nests bybinding two or more leaves (maybe up to 500) together. They stich the leaves using a stinky white substance either excreted by themselves or from trees.","date":"2012-02-27T22:47:00","category":"articles"}]